In [1]:
import pandas as pd

In [3]:
data = {"a":[1,2,3,4],
         "b":[5,6,7,8],
         "c":["Ram","krishna","siva","om"]
        }

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   a  b        c
0  1  5      Ram
1  2  6  krishna
2  3  7     siva
3  4  8       om

In [7]:
df.set_index('a')

   b        c
a
1  5      Ram
2  6  krishna
3  7     siva
4  8       om

In [10]:
df.set_index('a',inplace=True)

In [11]:
df

   b        c
a
1  5      Ram
2  6  krishna
3  7     siva
4  8       om

In [13]:
df=df.reset_index()

In [14]:
df

   a  b        c
0  1  5      Ram
1  2  6  krishna
2  3  7     siva
3  4  8       om

In [16]:
data = {"a":[1,2,3,4],
         "b":[5,6,7,8],
         "c":["Ram","krishna","siva","om"]
        }
df1 = pd.DataFrame(data,index=['a','b','c','d'])

In [17]:
df1

   a  b        c
a  1  5      Ram
b  2  6  krishna
c  3  7     siva
d  4  8       om

In [19]:
df1.reindex(['b','c','d','a'])
# just change the previous sequence

   a  b        c
b  2  6  krishna
c  3  7     siva
d  4  8       om
a  1  5      Ram

In [20]:
df1

   a  b        c
a  1  5      Ram
b  2  6  krishna
c  3  7     siva
d  4  8       om

In [22]:
df1.iterrows()
# for genrate the data
# row index return

In [24]:
for i in df1.iterrows():
    print(i)

('a', a      1
b      5
c    Ram
Name: a, dtype: object)
('b', a          2
b          6
c    krishna
Name: b, dtype: object)
('c', a       3
b       7
c    siva
Name: c, dtype: object)
('d', a     4
b     8
c    om
Name: d, dtype: object)

In [25]:
df1

   a  b        c
a  1  5      Ram
b  2  6  krishna
c  3  7     siva
d  4  8       om

In [26]:
for i , j in df1.iterrows():
    print(i,j)

a a      1
b      5
c    Ram
Name: a, dtype: object
b a          2
b          6
c    krishna
Name: b, dtype: object
c a       3
b       7
c    siva
Name: c, dtype: object
d a     4
b     8
c    om
Name: d, dtype: object

In [27]:
for i in df1.iteritems():
    print(i)
# columns item utha raha hai

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    5
b    6
c    7
d    8
Name: b, dtype: int64)
('c', a        Ram
b    krishna
c       siva
d         om
Name: c, dtype: object)

In [29]:
for col_name,column in df1.iteritems():
    print( col_name , column)

a a    1
b    2
c    3
d    4
Name: a, dtype: int64
b a    5
b    6
c    7
d    8
Name: b, dtype: int64
c a        Ram
b    krishna
c       siva
d         om
Name: c, dtype: object

In [30]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [31]:
list(df['a'])

[1, 2, 3, 4]

In [34]:
[i for i in df['a']]

[1, 2, 3, 4]

In [35]:
df1

   a  b        c
a  1  5      Ram
b  2  6  krishna
c  3  7     siva
d  4  8       om

In [36]:
def sumation(x):
    return x.sum()

In [37]:
df1.apply(sumation)

a                  10
b                  26
c    Ramkrishnasivaom
dtype: object

In [38]:
df1.apply(sumation)

a                  10
b                  26
c    Ramkrishnasivaom
dtype: object

In [39]:
df2=df1[['a','b']]

In [40]:
df2

   a  b
a  1  5
b  2  6
c  3  7
d  4  8

In [41]:
df2.applymap(lambda x :x**2)

    a   b
a   1  25
b   4  36
c   9  49
d  16  64

In [42]:
def multi(x):
    return x**2

In [43]:
df2.apply(multi)

    a   b
a   1  25
b   4  36
c   9  49
d  16  64

In [44]:
df1

   a  b        c
a  1  5      Ram
b  2  6  krishna
c  3  7     siva
d  4  8       om

In [45]:
df

   a  b        c
0  1  5      Ram
1  2  6  krishna
2  3  7     siva
3  4  8       om

In [46]:
df.sort_values('c')

   a  b        c
0  1  5      Ram
1  2  6  krishna
3  4  8       om
2  3  7     siva

In [47]:
df.sort_values('b')

   a  b        c
0  1  5      Ram
1  2  6  krishna
2  3  7     siva
3  4  8       om

In [48]:
df

   a  b        c
0  1  5      Ram
1  2  6  krishna
2  3  7     siva
3  4  8       om

In [49]:
df.sort_index()

   a  b        c
0  1  5      Ram
1  2  6  krishna
2  3  7     siva
3  4  8       om

In [50]:
df.sort_index(ascending=False)

   a  b        c
3  4  8       om
2  3  7     siva
1  2  6  krishna
0  1  5      Ram

In [51]:
df3=pd.DataFrame({"Desc" :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language."] })

In [52]:
df3
# complete data is not visible to the user

                                                Desc
0  Data Science Masters course is highly curated ...